{
    "title": "150_dicts.html",
    "sections": [
        {
            "title": "Dictionaries",
            "blocks": [
                {
                    "content": "<p>Normal lists (arrays) are usually a set of numbered elements, so if you want to make a reference to any list item, you must specify its number.\nThe number of element in the list uniquely identifies the item itself. But identification numbers\nare not always convenient. For example,  the routes of trains\nin Russia use letters and numbers as identification code (number and one digit), also numerical-alphabetic\n code identifies the flights, i.e. information about flights, trains or\naircraft ID should be stored not as a number but as a text string.\n\n<p>Data structure, which allows to use an arbitrary type of index instead of numerical, is called <i>dictionary</i> or <i>associative array</i>.\nThe corresponding data structure in Python is called <code>dict</code>.\n\n<p>Consider a simple example. Get the dictionary <code>Capitals</code>,\nwhere index is the name of the country, and the value&nbsp;&mdash; the name of the capital of this country.\nNow for a row with the name of the country we can easily idenify its capital.",
                    "type": "html"
                },
                {
                    "language": "python3",
                    "input": null,
                    "content": "# Create empty dict Capitals\nCapitals = dict()\n\n# Fill it with some values\nCapitals['Russia'] = 'Moscow'\nCapitals['Ukraine'] = 'Kiev'\nCapitals['USA'] = 'Washington'\n\nCountries = ['Russia', 'France', 'USA', 'Russia']\n\nfor country in Countries:\n  # For each country from the list check to see whether it is in the dictionary Capitals\n    if country in Capitals:\n        print('The capital of ' + country + ' is ' + Capitals[country])\n    else:\n        print('The capital of ' + country + ' is unknown')\n\n",
                    "type": "code"
                },
                {
                    "content": "<p>So, each element of the dictionary consists of two objects:\n<i>key</i> and <i>values</i>. In our example key\nis the country name and the value is the name of the capital.\nThe key identifies the element of the dictionary, the value is the data\ncorresponding to the given key. Key values are\nunique, i. e. there can't be two identical keys in the dictionary.\n\n<p>We are used to dictionaries around us, the usual paper\ndictionaries (defining, monolingual, bilingual). For defining dictionary the key\nis the word (the title of the article), and the value is the article itself, and in order to access the article, you must specify the word-key.\n\n<p>A telephone directory is another example of dictionary data structure.\nIn this case, the key is the name and value is the phone number. For both the dictionary and telephone directory it's easy to find an element of the dictionary with a given key (e.g.,\nif records are stored in alphabetical order of the keys, you can easily find your key with a binary search), but if the key is unknown, and we know only the value, \nthe search for the element with the given value may require a consistent view of all elements of the dictionary.</p>\n\n<p>An important feature of the associative array is that it is  dynamic, i. e. \nyou can add new elements with any keys and delete the existing elements.\nThe amount of memory used is proportional to the size of the associative array.\nAccess to the elements of an associative array is slower than\nfor ordinary arrays, but still pretty quickly.\n\n<p>In Python, the key can be any immutable (not changeable) data type:\nintegers and real numbers, strings, tuples. The key in the dictionary may not be a set, but may be an element of type <code>frozenset</code>: \na special data type analogue of a type <code>set</code> that cannot be modified after creation.\nThe dictionary element value can be any data type, including modifiable.",
                    "type": "html"
                }
            ]
        },
        {
            "title": "Applying dictionaries",
            "blocks": [
                {
                    "content": "<p>Dictionaries are used in the following cases:\n\n <li>to count the number of some objects. In this case, you need to make a dictionary\nwhere keys are objects and values are amounts.\n <li>the storage of any data associated with the object. The keys are\nobjects, the values are associated data. For example, if you want to determine month's sequence number by its name, you can do it \nusing the dictionary <code>Num['January'] = 1; Num['February'] = 2; ...</code>.\n <li>setting the correspondence between the objects (for instance, &laquo;the parent&mdash;descendant&raquo;).\nThe key is the object and the  value is the corresponding object.\n <li>if you need a simple array, but the maximum value of the index of the element is very large,\nthough not  all the possible indexes  will be used (so-called\n&quot;sparse array&quot;), you can use associative array to save memory.\n</ul>\n\n<p>An empty dictionary can be created using the function <code>dict()</code> or \nan empty pair of curly braces <code>{}</code> (this is actually the reason  the curly braces\ncannot be used to create an empty set). To create a dictionary\nwith some set of initial values, you can use the following constructions:",
                    "type": "html"
                },
                {
                    "language": "python3",
                    "input": null,
                    "content": "Capitals = {'Russia': 'Moscow', 'Ukraine': 'Kiev', 'USA': 'Washington'}\nCapitals = dict(RA = 'Moscow', Ukraine = 'Kiev', USA = 'Washington')\nCapitals = dict([(\"Russia\", \"Moscow\"), (\"Ukraine\", \"Kiev\"), (\"USA\", \"Washington\")])\nCapitals = dict(zip([\"Russia\", \"Ukraine\", \"USA\"], [\"Moscow\", \"Kiev\", \"Washington\"]))\nprint(Capitals)\n",
                    "type": "code"
                },
                {
                    "content": "<p>The first two methods can only be used to create small dictionaries by listing all their elements.\nIn addition, in the second method, the keys are passed as named  parameters of  <code>dict</code>, so\nin this case, the keys can only be strings, and only correct identificators.\nIn the third and fourth case, you can create large dictionaries, if transferred arguments\nare a ready-made list, which can be obtained not only from by listing all the elements, but are built in any other way  during the execution of the program. In the third way\nthe function <code>dict</code> needs to recieve a list where each element is a tuple of\ntwo elements: key and value. The fourth method uses the function <code>zip</code>,\nwhich needs to recieve two lists of equal length: a list of keys and list of values.",
                    "type": "html"
                }
            ]
        },
        {
            "title": "Working with dictionary items",
            "blocks": [
                {
                    "content": "<p>Basic operation: getting value of the element by its key. It is written exactly as for lists: <code>A[key]</code>. If there is no element with specified key  in the dictionary\nit raises the exception <code>KeyError</code>.\n\n<p>Another way to define the value based on a key is a method <code>get</code>:\n<code>A.get(key)</code>. If there is no element with the key <code>get</code>  in the dictionary,\nit returns <code>None</code>. In the form  with two arguments\n<code>A.get(key, val)</code> method returns <code>val</code>, \nif an element with the key <code>key</code> is not in the dictionary.\n\n<p>To check if an element belongs to a dictionary operations <code>in</code>\nand <code>not in</code> are used, same as for sets.\n\n<p>To add a new item to the dictionary you just need to assign it with some value:\n<code>A[key] = value</code>.\n\n<p>To remove an item from the dictionary you can use <code>del A[key]</code>\n(operation raises an exception <code>KeyError</code> if there is no such key in the dictionary.)\nHere are two safe ways to remove an item from the dictionary.",
                    "type": "html"
                },
                {
                    "language": "python3",
                    "input": null,
                    "content": "A = {'ab' : 'ba', 'aa' : 'aa', 'bb' : 'bb', 'ba' : 'ab'}\n\nkey = 'ac'\nif key in A:\n    del A[key]\n\ntry:\n    del A[key]\nexcept KeyError:\n\tprint('There is no element with key \"' + key + '\" in dict')\nprint(A)\n",
                    "type": "code"
                },
                {
                    "content": "<p>In the first case, we preliminary check the presence of an element, then we catch and handle the exception.\n\n<p>Another way to remove an item from the dictionary is the method <code>pop</code>:\n<code>A.pop(key)</code>. This method returns the value of the removed element and if\nthe element with the given key is not in the dictionary, an exception is raised. If\nthe method <code>pop</code> receives a second parameter, than for  the missing element it will return the value of this parameter. This allows\n to organize safely the  removal of the element from the dictionary: <code>A.pop(key, None)</code>.",
                    "type": "html"
                }
            ]
        },
        {
            "title": "Iterating dictionary",
            "blocks": [
                {
                    "content": "<p>You can easily iterate through the keys of all items in the dictionary:",
                    "type": "html"
                },
                {
                    "language": "python3",
                    "input": null,
                    "content": "A = dict(zip('abcdef', list(range(6))))\nfor key in A:\n    print(key, A[key])\n",
                    "type": "code"
                },
                {
                    "content": "<p>The following methods return <i>representation</i> of the elements of the dictionary.\nThe representations are  similar to sets, but they change,\nif you change the values of the elements. Method <code>keys</code>\nreturns a representation of the keys of all elements, <code>values</code>\nreturns a representation of all values, and the method <code>items</code>\nreturns a representation of all pairs (tuples) of keys and values.\n\n<p>Thus, for a quick check whether the value <code>val</code> is \namong all the values of the dictionary <code>A</code> you should use boolean condition\n<code>val in A.values()</code>. To loop through keys and variables, you can do the following:",
                    "type": "html"
                },
                {
                    "language": "python3",
                    "input": null,
                    "content": "A = dict(zip('abcdef', list(range(6))))\nfor key, val in A.items():\n    print(key, val)\n",
                    "type": "code"
                },
                {
                    "content": "",
                    "type": "html"
                }
            ]
        }
    ]
}